export function StoryPage() {
	return (
		<div className="relative h-screen w-1/2 space-y-10 overflow-hidden bg-gradient-to-r from-pink-100 via-white to-pink-50 px-20 outline">
			<div className="animate-scroll-infinite space-y-10">
				<h1 className="text-shadow-pink mx-auto mt-10 h-fit rounded-full px-10 py-3 text-center text-5xl font-bold text-white outline outline-black">
					赔罪自拍
				</h1>

				<section className="space-y-5 indent-10 text-xl font-bold leading-loose">
					<p>
						我是圈里有名的花瓶女明星，出道两年时间，拍了几部偶像剧，但都是戏份不多的女配角，稳坐花瓶美人称号。
					</p>
					<p>
						这并不是因为我演技不够好，也不是因为我身后没有大腿可抱，是因为大腿的醋劲儿太大了，不仅没有给我的演艺事业形成正面影响，反而一直在拉我的后腿。
					</p>
					<p>黎文曜这个醋坛子，接受不了我现代偶像剧的任何亲密戏份。</p>
					<p>于是，所有我能凭颜值接到的戏份都被尺度给打了回去。</p>
					<p>小说内容蹉跎了两年多，经纪人终于灵机一动</p>
					<p>
						我是圈里有名的花瓶女明星，出道两年时间，拍了几部偶像剧，但都是戏份不多的女配角，稳坐花瓶美人称号。
					</p>
					<p>
						这并不是因为我演技不够好，也不是因为我身后没有大腿可抱，是因为大腿的醋劲儿太大了，不仅没有给我的演艺事业形成正面影响，反而一直在拉我的后腿。
					</p>
					<p>黎文曜这个醋坛子，接受不了我现代偶像剧的任何亲密戏份。</p>
					<p>于是，所有我能凭颜值接到的戏份都被尺度给打了回去。</p>
					<p>小说内容蹉跎了两年多，经纪人终于灵机一动</p>
					<p>
						我是圈里有名的花瓶女明星，出道两年时间，拍了几部偶像剧，但都是戏份不多的女配角，稳坐花瓶美人称号。
					</p>
					<p>
						这并不是因为我演技不够好，也不是因为我身后没有大腿可抱，是因为大腿的醋劲儿太大了，不仅没有给我的演艺事业形成正面影响，反而一直在拉我的后腿。
					</p>
					<p>黎文曜这个醋坛子，接受不了我现代偶像剧的任何亲密戏份。</p>
					<p>于是，所有我能凭颜值接到的戏份都被尺度给打了回去。</p>
					<p>小说内容蹉跎了两年多，经纪人终于灵机一动</p>
					<p>
						我是圈里有名的花瓶女明星，出道两年时间，拍了几部偶像剧，但都是戏份不多的女配角，稳坐花瓶美人称号。
					</p>
					<p>
						这并不是因为我演技不够好，也不是因为我身后没有大腿可抱，是因为大腿的醋劲儿太大了，不仅没有给我的演艺事业形成正面影响，反而一直在拉我的后腿。
					</p>
					<p>黎文曜这个醋坛子，接受不了我现代偶像剧的任何亲密戏份。</p>
					<p>于是，所有我能凭颜值接到的戏份都被尺度给打了回去。</p>
					<p>小说内容蹉跎了两年多，经纪人终于灵机一动</p>
					<p>
						我是圈里有名的花瓶女明星，出道两年时间，拍了几部偶像剧，但都是戏份不多的女配角，稳坐花瓶美人称号。
					</p>
					<p>
						这并不是因为我演技不够好，也不是因为我身后没有大腿可抱，是因为大腿的醋劲儿太大了，不仅没有给我的演艺事业形成正面影响，反而一直在拉我的后腿。
					</p>
					<p>黎文曜这个醋坛子，接受不了我现代偶像剧的任何亲密戏份。</p>
					<p>于是，所有我能凭颜值接到的戏份都被尺度给打了回去。</p>
					<p>小说内容蹉跎了两年多，经纪人终于灵机一动</p>
				</section>
			</div>

			<span className="text-shadow absolute bottom-4 right-4 text-white">
				*本故事纯属虚构
			</span>
		</div>
	)
}
